bit-finance/DataProcessors/бит_ВзаимодейтсвиеСИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ВзаимодейтсвиеСИИ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АссистентыИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ИсторияВзаимодействияСИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияВзаимодействияСИИ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РолиВзаимодействияИИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВложения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АссистентыИИ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_РолиВзаимодействияИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РолиВзаимодействияИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>System</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Developer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>User</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Notice</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/DataProcessors/бит_ВзаимодейтсвиеСИИ/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторДиалога = Новый УникальныйИдентификатор;
	ЗаполнитьАссистентаПоУмолчанию();
	Элементы.ГруппаНастройки.Видимость = Ложь;
	УправлениеФормой(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПередачаДанныхОтчетаВИИ"
		И Источник = ЭтотОбъект Тогда
		ПодгрузитьДанныеОтчетаДляВзаимодейсвтия(Параметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АватарАссистентаНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ПриОкончанииВыбораАссистента", ЭтотОбъект);
	ОткрытьФорму("Справочник.бит_АссистентыИИ.ФормаВыбора",,,,,,Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторияДиалогов

&НаКлиенте
Процедура ИсторияДиалоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТекущегоДиалога = Элементы.ИсторияДиалогов.ТекущиеДанные;
	Если СтрокаТекущегоДиалога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаТекущегоДиалога.ИдентификаторДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	ВернутьсяКДиалогу(СтрокаТекущегоДиалога.ИдентификаторДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВзаимодействияПриИзменении(Элемент)
	
	ОбновитьОкноВзаимодействия();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтправитьСообщение(Команда)
	
	Если ПустаяСтрока(ТекстЗапросаПользователя) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьВзаимодействиеСМоделью();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьНастройки(Команда)
	
	Элементы.ГруппаНастройки.Видимость = НЕ Элементы.ГруппаНастройки.Видимость;
	ОбновитьИсториюДиалогов();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовоеОбсуждение(Команда)
	
	НачатьНовыйДиалог();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаШаблоныПромптов(Команда)
	
	ОповещениеВыборШаблона = Новый ОписаниеОповещения("ОповещениеОВыбореШаблона", ЭтотОбъект);
	ОткрытьФорму("Справочник.бит_ШаблоныПромптовИИ.ФормаВыбора",,,,,,ОповещениеВыборШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрикрепитьФайл(Команда)
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru = 'Файлы PDF(*.pdf,*.PDF)|*.pdf;*.PDF|Текстовые файлы (*.txt)|*.txt|Все файлы (*.*)|*.*'");
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл для передачи AI'");
	
	ОбработкаВыбораФайла = Новый ОписаниеОповещения("ПрикрепитьФайлВыборФайлаЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОбработкаВыбораФайла, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КомандаОчиститьИсториюДиалогов(Команда)
	
	Ответ = Ждать ЗадатьВопросОбОчисткеДанных();
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьИсториюДиалогов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьДиалог(Команда)
	
	ТекущиеДанные = Элементы.ИсторияДиалогов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ПустаяСтрока(ТекущиеДанные.ИдентификаторДиалога) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьИсториюДиалогов(ТекущиеДанные.ИдентификаторДиалога);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройкиТекущегоДиалога(Команда)
	
	Элементы.ИсторияВзаимодействия.Видимость = НЕ Элементы.ИсторияВзаимодействия.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьАссистентаПоУмолчанию()
	
	Если НЕ Объект.Ассистент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АссистентыИИ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_АссистентыИИ КАК АссистентыИИ
	|ГДЕ
	|	НЕ АссистентыИИ.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоДоступныхАссистентов = Выборка.Количество();
	Если КоличествоДоступныхАссистентов <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка.Следующий();
	Объект.Ассистент = Выборка.Ссылка;
	ОбработатьСменуАссистента();	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСменуАссистента()
	
	Если Объект.Ассистент.Пустая() Тогда
		Элементы.ГруппаАссистента.ОтображатьЗаголовок = Ложь;
	Иначе
		ИмяАссистента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ассистент, "Наименование");
		Элементы.ГруппаАссистента.Заголовок = ИмяАссистента;
		Элементы.ГруппаАссистента.ОтображатьЗаголовок = Истина;
		Элементы.АватарАссистента.Картинка = Справочники.бит_АссистентыИИ.Аватарка(Объект.Ассистент);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыеПараметрыРеплики()
	
	ПараметрыРеплики = Новый Структура;
	
	ПараметрыРеплики.Вставить("Содержание", "");
	ПараметрыРеплики.Вставить("Роль", ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.ПустаяСсылка"));
	ПараметрыРеплики.Вставить("ОбновитьОтображение", Истина);
	ПараметрыРеплики.Вставить("ФиксироватьВИсторию", Истина);
	ПараметрыРеплики.Вставить("Вложение");
	ПараметрыРеплики.Вставить("Ассистент", ПредопределенноеЗначение("Справочник.бит_АссистентыИИ.ПустаяСсылка"));
	ПараметрыРеплики.Вставить("Период", '  00010101');
	
	Возврат ПараметрыРеплики;
	
КонецФункции

&НаСервере
Процедура ДобавитьРепликуВзаимодействия(ПараметрыРеплики)
	
	Содержание = ПараметрыРеплики.Содержание;
	Роль       = ПараметрыРеплики.Роль;
	Вложение   = ПараметрыРеплики.Вложение;
	
	ДанныеВложения   = Неопределено;
	ОписаниеВложения = "";
	Если ТипЗнч(Вложение) = Тип("Структура") Тогда
		Если ТипЗнч(Вложение.Данные) = Тип("ХранилищеЗначения") Тогда
			ДанныеВложения = Вложение.Данные;
		Иначе
			ДанныеВложения = Новый ХранилищеЗначения(Вложение.Данные, Новый СжатиеДанных(9));
		КонецЕсли;
		ОписаниеВложения = Вложение.Описание;
	КонецЕсли;
	
	Ассистент = ПараметрыРеплики.Ассистент;
	Если Роль = Перечисления.бит_РолиВзаимодействияИИ.Assistant
		И НЕ ЗначениеЗаполнено(Ассистент) Тогда
		Ассистент = Объект.Ассистент;
	КонецЕсли;
	
	Период = ПараметрыРеплики.Период;
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НоваяСтрокаВзаимодействия = ИсторияВзаимодействия.Добавить(); 
	НоваяСтрокаВзаимодействия.Роль             = Роль;
	НоваяСтрокаВзаимодействия.Содержание       = Содержание;
	НоваяСтрокаВзаимодействия.ДанныеВложения   = ДанныеВложения;
	НоваяСтрокаВзаимодействия.ОписаниеВложения = ОписаниеВложения;
	НоваяСтрокаВзаимодействия.Ассистент        = Ассистент;
	НоваяСтрокаВзаимодействия.Период           = Период;
	
	Если ПараметрыРеплики.ФиксироватьВИсторию Тогда
		МенеджерИстории = РегистрыСведений.бит_ИсторияВзаимодействияСИИ.СоздатьМенеджерЗаписи();
		МенеджерИстории.Период               = Период;
		МенеджерИстории.Пользователь         = Пользователи.ТекущийПользователь();
		МенеджерИстории.ИдентификаторДиалога = ИдентификаторДиалога;
		МенеджерИстории.Роль                 = Роль;
		МенеджерИстории.Содержание           = Содержание;
		МенеджерИстории.ДанныеВложения       = ДанныеВложения;
		МенеджерИстории.ОписаниеВложения     = ОписаниеВложения;
		МенеджерИстории.Ассистент            = Ассистент;
		МенеджерИстории.Записать();
	КонецЕсли;
	
	Если ПараметрыРеплики.ОбновитьОтображение Тогда
		ОбновитьОкноВзаимодействия();
		Если ПараметрыРеплики.ФиксироватьВИсторию Тогда
			ОбновитьИсториюДиалогов();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОкноВзаимодействия()
	
	Сообщения   = Новый Массив;
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());
	
	Для каждого СтрокаВзаимодействия Из ИсторияВзаимодействия Цикл
		Роль = СтрокаВзаимодействия.Роль;
		Если Роль <> Перечисления.бит_РолиВзаимодействияИИ.User
			И Роль <> Перечисления.бит_РолиВзаимодействияИИ.Assistant
			И Роль <> Перечисления.бит_РолиВзаимодействияИИ.Notice Тогда
			Продолжить;
		КонецЕсли;
		
		ВывестиМеткуДня(Сообщения, СтрокаВзаимодействия, ТекущийДень);
		ВывестиМеткуАвтораИВремени(Сообщения, СтрокаВзаимодействия);
		
		ТекстСообщенияHTML = бит_ИскусственныйИнтеллектКлиентСервер.ОбработанныйТекстДляHTML(
								СтрокаВзаимодействия.Содержание);
		Оформление         = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыОформленияHTML();
		Если Роль = Перечисления.бит_РолиВзаимодействияИИ.User Тогда
			Оформление.Выравнивание = ГоризонтальноеПоложение.Право;
			Оформление.ЦветФона     = "СветлоЗеленый";
		ИначеЕсли Роль = Перечисления.бит_РолиВзаимодействияИИ.Notice Тогда
			Оформление.Выравнивание = ГоризонтальноеПоложение.Лево;
			Оформление.ЦветТекста   = "Серый";
			Оформление.Курсив       = Истина;
		Иначе
			Оформление.Выравнивание = ГоризонтальноеПоложение.Лево;
			Оформление.ЦветФона     = "Белый";
		КонецЕсли;
		ТекстСообщенияHTML = бит_ИскусственныйИнтеллектКлиентСервер.ТекстСообщенияHTMLСОформлением(
								ТекстСообщенияHTML, Оформление);
		Сообщения.Добавить(ТекстСообщенияHTML);
	КонецЦикла;
	
	ТелоЧата = СтрСоединить(Сообщения, "<br>");
	ТелоЧата = СтрЗаменить(ТелоЧата, "<-br><br>", "");
	
	ШаблонHTML = "<html><head></head><body>%1</body></html>";
	Структура = Новый Структура;
	ОкноВзаимодействия.УстановитьHTML(СтрШаблон(ШаблонHTML, ТелоЧата), Структура);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиМеткуДня(СообщенияHTML, СтрокаДиалога, ТекущийДень)
	
	ДеньСобытия = НачалоДня(СтрокаДиалога.Период);
	Если ДеньСобытия = ТекущийДень Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийДень = ДеньСобытия;
	Оформление  = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыОформленияHTML();
	Оформление.Выравнивание = ГоризонтальноеПоложение.Центр;
	Оформление.ЦветТекста   = "Белый";
	Оформление.ЦветФона     = "СветлоСерый";
	ПредставлениеДаты       = Формат(ТекущийДень, "ДФ='dd MMMM'");
	ТекстСообщенияHTML      = бит_ИскусственныйИнтеллектКлиентСервер.ТекстСообщенияHTMLСОформлением(ПредставлениеДаты, Оформление);
	СообщенияHTML.Добавить(ТекстСообщенияHTML);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиМеткуАвтораИВремени(СообщенияHTML, СтрокаДиалога)
	
	ШаблонМетки       = "%1 (%2)";
	Автор             = НСтр("ru='Система'");
	ПредставлениеДаты = Формат(СтрокаДиалога.Период, "ДФ=HH:mm");
	
	Оформление = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыОформленияHTML();
	
	Автор = "";
	Роль  = СтрокаДиалога.Роль;
	Если Роль = Перечисления.бит_РолиВзаимодействияИИ.User Тогда
		Оформление.Выравнивание = ГоризонтальноеПоложение.Право;
		Оформление.ЦветТекста   = "Зеленый";
		Автор = НСтр("ru='Вы'");
	ИначеЕсли Роль = Перечисления.бит_РолиВзаимодействияИИ.Notice Тогда
		Оформление.Выравнивание = ГоризонтальноеПоложение.Лево;
		Оформление.ЦветТекста   = "Серый";
		Автор = НСтр("ru='Система'");
	Иначе
		Оформление.Выравнивание = ГоризонтальноеПоложение.Лево;
		Оформление.ЦветТекста   = "Зеленый";
		Автор = СтрокаДиалога.Ассистент;
	КонецЕсли;
		
	Метка = СтрШаблон(ШаблонМетки, Автор, ПредставлениеДаты);
	
	ТекстСообщенияHTML = бит_ИскусственныйИнтеллектКлиентСервер.ТекстСообщенияHTMLСОформлением(Метка, Оформление) + "<-br>";
	СообщенияHTML.Добавить(ТекстСообщенияHTML);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВзаимодействиеСМоделью()
	
	ДлительнаяОперация = НачатьОбработкуЗапросаИскусственнымИнтеллектом();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок      = НСтр("ru='Обработка запроса'");
	ПараметрыОжидания.ТекстСообщения = СтрШаблон(НСтр("ru='%1 думает над ответом.'"), ИмяАссистента);
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработкиЗапросаИскусственнымИнтеллектом", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
		
КонецПроцедуры

&НаСервере
Функция НачатьОбработкуЗапросаИскусственнымИнтеллектом()
	
	ПараметрыВзаимодействия = ПараметрыВзаимодействияСМоделью();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"бит_ИскусственныйИнтеллектКлиентСервер.ВзаимодействиеСМоделью", ПараметрыВзаимодействия);
	
КонецФункции

&НаСервере
Функция ПараметрыВзаимодействияСМоделью()
	
	ПараметрыВзаимодействия = бит_ИскусственныйИнтеллектКлиентСервер.НовыеПараметрыВзаимодействияСМоделью();
	ПараметрыВзаимодействия.Ассистент = Объект.Ассистент;
	
	ПараметрыАссистента = бит_ИскусственныйИнтеллект.ПараметрыАссистента(Объект.Ассистент);
	ЗаполнитьЗначенияСвойств(ПараметрыВзаимодействия, ПараметрыАссистента);
	
	Если НЕ ПустаяСтрока(ТекстЗапросаПользователя) Тогда
		ПараметрыРеплики = НовыеПараметрыРеплики();
		ПараметрыРеплики.Содержание          = ТекстЗапросаПользователя;
		ПараметрыРеплики.Роль                = Перечисления.бит_РолиВзаимодействияИИ.User;
		ПараметрыРеплики.ОбновитьОтображение = Ложь;
		ДобавитьРепликуВзаимодействия(ПараметрыРеплики);
		ТекстЗапросаПользователя = "";
	КонецЕсли;
	
	ПараметрыВзаимодействия.ЗапросПользователя =
		ОбщегоНазначения.ТаблицаЗначенийВМассив(ИсторияВзаимодействия.Выгрузить());
		
	Возврат ПараметрыВзаимодействия;
	
КонецФункции

// Обработка результата выполнения фонового задания.
//
// Параметры:
// 	Результат - см. ДлительныеОперацииКлиент.НовыйРезультатДлительнойОперации
// 	ДополнительныеПараметры - Неопределено
//
&НаКлиенте
Процедура ПриЗавершенииОбработкиЗапросаИскусственнымИнтеллектом(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	РезультатОбработкиЗапроса = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
	ПараметрыРеплики = НовыеПараметрыРеплики();
	ПараметрыРеплики.Содержание = РезультатОбработкиЗапроса.ОтветСервера;
	ПараметрыРеплики.Роль       = ?(РезультатОбработкиЗапроса.ЗапросВыполнен,
		ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.Assistant"),
		ПредопределенноеЗначение("Перечисление.бит_РолиВзаимодействияИИ.Notice"));
	ДобавитьРепликуВзаимодействия(ПараметрыРеплики);

КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииВыбораАссистента(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Ассистент = Результат;
	ОбработатьСменуАссистента();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект 	 = Форма.Объект;
	
	Элементы.ГруппаВзаимодействие.Видимость         = НЕ Объект.Ассистент.Пустая();
	Элементы.ФормаКомандаОткрытьНастройки.Видимость = НЕ Объект.Ассистент.Пустая();
	
КонецПроцедуры

&НаСервере
Процедура ПодгрузитьДанныеОтчетаДляВзаимодейсвтия(ПараметрыОтчета)
	
	ПараметрыВложения = НовыеПараметрыВложения();
	ПараметрыВложения.Данные   = ПараметрыОтчета.ДанныеОтчета;
	// АПК:1297-выкл промпт для ассистента
	ПараметрыВложения.Описание =
		СтрШаблон("Это выгрузка отчета из 1С в формате %1. Служебная информация по данному отчету: %2.",
					ПараметрыОтчета.ФорматВыгрузки, ПараметрыОтчета.Описание);
	// АПК:1297-вкл
	ПараметрыВложения.ПодсказкаПользователю =
		СтрШаблон(НСтр("ru='Данные отчета ""%1"" загружены. Можно задавать вопросы ассистенту.'"),
					ПараметрыОтчета.ПредставлениеОтчета);
	ДобавитьВложение(ПараметрыВложения);
	
КонецПроцедуры

&НаСервере
Процедура ПрикрепитьФайлВыборФайлаЗавершениеНаСервере(ПомещенныйФайл, ДополнительныеПараметры)
	
	ПараметрыВложения = НовыеПараметрыВложения();
	
	ПараметрыВложения.Данные = ПолучитьИзВременногоХранилища(ПомещенныйФайл.Хранение);
	
	ОписаниеФайла = бит_ИскусственныйИнтеллектКлиентСервер.НовоеОписаниеФайлаВыгрузки(ПомещенныйФайл.Имя);
	
	ПараметрыВложения.Описание = бит_ИскусственныйИнтеллектКлиентСервер.ЗначениеВJSON(ОписаниеФайла);
	
	Если НЕ ПустаяСтрока(ОписаниеФайла.Имя) Тогда
		ПараметрыВложения.ПодсказкаПользователю =
			СтрШаблон(НСтр("ru='Файл %1 загружен. Можно задавать вопросы ассистенту.'"), ОписаниеФайла.Имя);
	Иначе
		ПараметрыВложения.ПодсказкаПользователю = НСтр("ru='Данные файла загружены. Можно задавать вопросы ассистенту.'");
	КонецЕсли;
	
	ДобавитьВложение(ПараметрыВложения);
	
КонецПроцедуры

&НаСервере
Функция НовыеПараметрыВложения()
	
	ПараметрыВложения = Новый Структура;
	ПараметрыВложения.Вставить("Данные");
	ПараметрыВложения.Вставить("Описание", "");
	ПараметрыВложения.Вставить("ПодсказкаПользователю", "");
	
	Возврат ПараметрыВложения;
	
КонецФункции

&НаСервере
Процедура ДобавитьВложение(ПараметрыВложения, ОбновитьОтображение = Истина, ФиксироватьВИсторию = Истина, Период = Неопределено)
	
	ПараметрыРеплики = НовыеПараметрыРеплики();
	ПараметрыРеплики.Содержание          = ПараметрыВложения.ПодсказкаПользователю;
	ПараметрыРеплики.Роль                = Перечисления.бит_РолиВзаимодействияИИ.Notice;
	ПараметрыРеплики.ОбновитьОтображение = ОбновитьОтображение;
	ПараметрыРеплики.ФиксироватьВИсторию = ФиксироватьВИсторию;
	ПараметрыРеплики.Вложение            = ПараметрыВложения;
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыРеплики.Период = Период;
	КонецЕсли;
	ДобавитьРепликуВзаимодействия(ПараметрыРеплики);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлВыборФайлаЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрикрепитьФайлВыборФайлаЗавершениеНаСервере(ПомещенныйФайл, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОВыбореШаблона(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборШаблонаПромпта(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборШаблонаПромпта(ШаблонПромпта)
	
	ТекстЗапросаПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонПромпта, "Содержание");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИсториюДиалогов()
	
	Если НЕ Элементы.ГруппаНастройки.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ИнтервалыДиалогов = ИсторияДиалогов.ПолучитьЭлементы();
	ИнтервалыДиалогов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВзаимодействия.ИдентификаторДиалога КАК ИдентификаторДиалога,
	|	ИсторияВзаимодействия.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ИсторияВзаимодействия.Период, ДЕНЬ) КАК ДеньВзаимодействия
	|ПОМЕСТИТЬ ИсторияПоследнихВзаимодействий
	|ИЗ
	|	РегистрСведений.бит_ИсторияВзаимодействияСИИ.СрезПоследних(, Пользователь = &ТекущийПользователь) КАК ИсторияВзаимодействия
	|ГДЕ
	|	ИсторияВзаимодействия.Пользователь = &ТекущийПользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервыеОбращения.ИдентификаторДиалога КАК ИдентификаторДиалога,
	|	ПервыеОбращения.Содержание КАК Содержание
	|ПОМЕСТИТЬ ПервыеОбращения
	|ИЗ
	|	РегистрСведений.бит_ИсторияВзаимодействияСИИ.СрезПервых(
	|			,
	|			Пользователь = &ТекущийПользователь
	|				И Роль = ЗНАЧЕНИЕ(Перечисление.бит_РолиВзаимодействияИИ.User)) КАК ПервыеОбращения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияПоследнихВзаимодействий.Период КАК Период,
	|	ИсторияПоследнихВзаимодействий.ИдентификаторДиалога КАК ИдентификаторДиалога,
	|	ПОДСТРОКА(ПервыеОбращения.Содержание, 1, 50) КАК Содержание,
	|	ВЫБОР
	|		КОГДА ИсторияПоследнихВзаимодействий.Период >= НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|			ТОГДА 0
	|		КОГДА ИсторияПоследнихВзаимодействий.ДеньВзаимодействия >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДЕНЬ, -7)
	|			ТОГДА 1
	|		КОГДА ИсторияПоследнихВзаимодействий.ДеньВзаимодействия >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), МЕСЯЦ, -1)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Интервал
	|ИЗ
	|	ИсторияПоследнихВзаимодействий КАК ИсторияПоследнихВзаимодействий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеОбращения КАК ПервыеОбращения
	|		ПО ИсторияПоследнихВзаимодействий.ИдентификаторДиалога = ПервыеОбращения.ИдентификаторДиалога
	|
	|УПОРЯДОЧИТЬ ПО
	|	Интервал,
	|	Период УБЫВ
	|ИТОГИ ПО
	|	Интервал";
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	ВыборкаИнтервалов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИнтервалов.Следующий() Цикл
		НовыйИнтервал       = ИнтервалыДиалогов.Добавить();
		ПредставлениеСтроки = НСтр("ru='Ранее'");
		Если ВыборкаИнтервалов.Интервал = 0 Тогда
			ПредставлениеСтроки = НСтр("ru='Сегодня'");
		ИначеЕсли ВыборкаИнтервалов.Интервал = 1 Тогда
			ПредставлениеСтроки = НСтр("ru='7 дней'");
		ИначеЕсли ВыборкаИнтервалов.Интервал = 2 Тогда
			ПредставлениеСтроки = НСтр("ru='30 дней'");
		КонецЕсли;
		НовыйИнтервал.ПредставлениеСтроки = ПредставлениеСтроки;
		
		СтрокиДиалогов  = НовыйИнтервал.ПолучитьЭлементы();
		ВыборкаДиалогов = ВыборкаИнтервалов.Выбрать();
		Пока ВыборкаДиалогов.Следующий() Цикл
			НоваяСтрокаДиалога = СтрокиДиалогов.Добавить();
			НоваяСтрокаДиалога.ПредставлениеСтроки  = ВыборкаДиалогов.Содержание;
			НоваяСтрокаДиалога.ИдентификаторДиалога = ВыборкаДиалогов.ИдентификаторДиалога;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВернутьсяКДиалогу(ИдентификаторСтарогоДиалога)
	
	ИдентификаторДиалога = ИдентификаторСтарогоДиалога;
	ИсторияВзаимодействия.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияВзаимодействия.Роль КАК Роль,
	|	ИсторияВзаимодействия.Содержание КАК Содержание,
	|	ИсторияВзаимодействия.ДанныеВложения КАК ДанныеВложения,
	|	ИсторияВзаимодействия.ОписаниеВложения КАК ОписаниеВложения,
	|	ИсторияВзаимодействия.Ассистент КАК Ассистент,
	|	ИсторияВзаимодействия.Период КАК Период
	|ИЗ
	|	РегистрСведений.бит_ИсторияВзаимодействияСИИ КАК ИсторияВзаимодействия
	|ГДЕ
	|	ИсторияВзаимодействия.Пользователь = &Пользователь
	|	И ИсторияВзаимодействия.ИдентификаторДиалога = &ИдентификаторДиалога
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияВзаимодействия.Период";
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ИдентификаторДиалога", ИдентификаторДиалога);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.ОписаниеВложения) Тогда
			ПараметрыРеплики = НовыеПараметрыРеплики();
			ПараметрыРеплики.Содержание          = Выборка.Содержание;
			ПараметрыРеплики.Роль                = Выборка.Роль;
			ПараметрыРеплики.ОбновитьОтображение = Ложь;
			ПараметрыРеплики.ФиксироватьВИсторию = Ложь;
			ПараметрыРеплики.Ассистент           = Выборка.Ассистент;
			ПараметрыРеплики.Период              = Выборка.Период;
			ДобавитьРепликуВзаимодействия(ПараметрыРеплики);
		Иначе
			ПараметрыВложения = НовыеПараметрыВложения();
	        ПараметрыВложения.Данные                = Выборка.ДанныеВложения;
			ПараметрыВложения.Описание              = Выборка.ОписаниеВложения;
			ПараметрыВложения.ПодсказкаПользователю = Выборка.Содержание;
											
			ДобавитьВложение(ПараметрыВложения, Ложь, Ложь, Выборка.Период);
		КонецЕсли;
	КонецЦикла;
	ОбновитьОкноВзаимодействия();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ИсторияДиалоговПредставлениеСтроки");
   	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор, "ИсторияДиалогов.ИдентификаторДиалога",
		ВидСравненияКомпоновкиДанных.Равно, "");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ЦветНедоступногоПоля);
	
КонецПроцедуры

&НаСервере
Процедура НачатьНовыйДиалог()
	
	ИдентификаторДиалога = Новый УникальныйИдентификатор;
	ИсторияВзаимодействия.Очистить();
	ОбновитьОкноВзаимодействия();
	
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ЗадатьВопросОбОчисткеДанных() 
	
	ТекстВопроса = НСтр("ru='Очистить историю всех диалогов?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ОчиститьИсториюДиалогов(ОтборИдентификаторДиалога = "")
	
	НаборДиалогов = РегистрыСведений.бит_ИсторияВзаимодействияСИИ.СоздатьНаборЗаписей();
	НаборДиалогов.Отбор.Пользователь.Установить(Пользователи.ТекущийПользователь());
	Если НЕ ПустаяСтрока(ОтборИдентификаторДиалога) Тогда
		НаборДиалогов.Отбор.ИдентификаторДиалога.Установить(ОтборИдентификаторДиалога);
	КонецЕсли;
	НаборДиалогов.Записать();
	
	НачатьНовыйДиалог();
	Элементы.ГруппаНастройки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти
